PS-PK-monitoring/raw/res.ps57.long.query_rt_plugin/res.thr13.ro.txt
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 13
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored

Forcing shutdown in 301 seconds

Threads started!

[  10s] threads: 13, tps: 0.00, reads: 161548.37, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 13, tps: 0.00, reads: 176920.41, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 13, tps: 0.00, reads: 175233.56, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 13, tps: 0.00, reads: 176212.14, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 13, tps: 0.00, reads: 177740.03, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 13, tps: 0.00, reads: 177119.23, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 13, tps: 0.00, reads: 173139.62, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 13, tps: 0.00, reads: 173770.44, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 13, tps: 0.00, reads: 176081.45, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 13, tps: 0.00, reads: 177668.96, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 13, tps: 0.00, reads: 178413.18, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 13, tps: 0.00, reads: 174374.66, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 13, tps: 0.00, reads: 173242.83, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 13, tps: 0.00, reads: 175089.88, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 13, tps: 0.00, reads: 178397.30, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 13, tps: 0.00, reads: 176148.59, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 13, tps: 0.00, reads: 175953.14, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 13, tps: 0.00, reads: 174765.03, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 13, tps: 0.00, reads: 175330.51, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 13, tps: 0.00, reads: 172689.67, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 13, tps: 0.00, reads: 173931.03, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 13, tps: 0.00, reads: 173352.13, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 13, tps: 0.00, reads: 175909.80, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 13, tps: 0.00, reads: 174626.32, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 13, tps: 0.00, reads: 177094.58, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 13, tps: 0.00, reads: 176574.13, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 13, tps: 0.00, reads: 175582.90, writes: 0.00, response time: 0.09ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 13, tps: 0.00, reads: 176319.31, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 13, tps: 0.00, reads: 178751.78, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            52597632
        write:                           0
        other:                           0
        total:                           52597632
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 52597632 (175325.37 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0001s
    total number of events:              52597632
    total time taken by event execution: 3846.3801s
    response time:
         min:                                  0.06ms
         avg:                                  0.07ms
         max:                                  0.60ms
         approx.  95 percentile:               0.09ms

Threads fairness:
    events (avg/stddev):           4045971.6923/55802.25
    execution time (avg/stddev):   295.8754/0.29